app/controllers/bills_controller.rb

  def index
    @bills = Group.find(params[:group_id]).bills
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bills".* FROM "bills" WHERE "bills"."group_id" = ?  [["group_id", 1]]

  def new
    @members = Group.find(params[:group_id]).users
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."id" = ?  [["group_id", 1], ["id", 2]]

  def create
    new_bill = Bill.create(bill_params)
    new_bill.group = Group.find(params[:group_id])
    new_bill.save
---
INSERT INTO "bills" ("item", "amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item", "ABD"], ["amount", 201.0], ["user_id", 1], ["created_at", "2017-06-13 17:08:10.996766"], ["updated_at", "2017-06-13 17:08:10.996766"]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "bills" SET "group_id" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["group_id", 1], ["updated_at", "2017-06-13 17:08:11.454847"], ["id", 1]]
UPDATE "groups" SET "updated_at" = '2017-06-13 17:08:11.457773' WHERE "groups"."id" = ?  [["id", 1]]

  def edit
    @bill = Bill.find(params[:id])
    @members = @bill.group.users
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ? AND "users"."id" = ?  [["group_id", 3], ["id", 1]]

  def update
    @bill = Bill.find(params[:id])
    @bill.update!(bill_params)
    redirect_to group_bills_path(@bill.group)
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "bills" SET "item" = ?, "location" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["item", "Lunch"], ["location", "Baar"], ["updated_at", "2017-06-15 04:01:42.503443"], ["id", 8]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]